# SQL Overview

## SQL Environment

Importing sqlalchemy module

In [1]:
%%capture
!pip install ipython-sql sqlalchemy
import sqlalchemy

Generate database file to storage tables

In [2]:
sqlalchemy.create_engine("sqlite:///KIMTAY.db")
%load_ext sql
%sql sqlite:///KIMTAY.db

## SQL Table Creation

SALES_REP Table Creation

In [3]:
%%sql

DROP TABLE IF EXISTS SALES_REP;
CREATE TABLE SALES_REP
(
   REP_ID CHAR(2) PRIMARY KEY,
   FIRST_NAME VARCHAR(20),
   LAST_NAME VARCHAR(20),
   ADDRESS VARCHAR(20),
   CITY VARCHAR(15),
   STATE CHAR(2),
   POSTAL CHAR(5),
   CELL_PHONE CHAR(12),
   COMMISSION DECIMAL(7,2),
   RATE DECIMAL(3,2)
);

 * sqlite:///KIMTAY.db
Done.
Done.

[]

Populating SALES_REP Table

In [4]:
%%sql
INSERT INTO SALES_REP VALUES ('05','Susan','Garcia',  '42 Mountain Ln','Cody',     'WY', '82414', '307-824-1245', 12743.16, 0.04);      
INSERT INTO SALES_REP VALUES ('10','Richard','Miller','87 Pikes Dr',   'Ralston',  'WY', '82440', '307-406-4321', 20872.11, 0.06);     
INSERT INTO SALES_REP VALUES ('15','Donna','Smith',   '312 Oak Rd',    'Powell',   'WY', '82440', '307-982-8401', 14912.92, 0.04);          
INSERT INTO SALES_REP VALUES ('20','Daniel','Jackson','19 Lookout Dr', 'Elk Butte','WY', '82433', '307-883-9481', 0.00,     0.04);

 * sqlite:///KIMTAY.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

SALES_REP Table Visualization

In [5]:
%%sql
SELECT * FROM SALES_REP

 * sqlite:///KIMTAY.db
Done.

[('05', 'Susan', 'Garcia', '42 Mountain Ln', 'Cody', 'WY', '82414', '307-824-1245', 12743.16, 0.04),
 ('10', 'Richard', 'Miller', '87 Pikes Dr', 'Ralston', 'WY', '82440', '307-406-4321', 20872.11, 0.06),
 ('15', 'Donna', 'Smith', '312 Oak Rd', 'Powell', 'WY', '82440', '307-982-8401', 14912.92, 0.04),
 ('20', 'Daniel', 'Jackson', '19 Lookout Dr', 'Elk Butte', 'WY', '82433', '307-883-9481', 0, 0.04)]

CUSTOMER, ITEM, INVOICES, INVOICE_LINE Tables Creation

In [6]:
%%sql     

DROP TABLE IF EXISTS CUSTOMER;
CREATE TABLE CUSTOMER
(
   CUST_ID CHAR(3) PRIMARY KEY,
   FIRST_NAME VARCHAR(20),
   LAST_NAME VARCHAR(20),
   ADDRESS VARCHAR(20),
   CITY VARCHAR(15),
   STATE CHAR(2),
   POSTAL CHAR(5),
   EMAIL VARCHAR(30),
   BALANCE DECIMAL(7,2),
   CREDIT_LIMIT DECIMAL (7,2),
   REP_ID CHAR(2)
);

INSERT INTO CUSTOMER VALUES('125','Joey'    ,'Smith',     '17 Fourth St',      'Cody',     'WY','82414','jsmith17@example.com',    80.68 ,500.00   ,'05');              
INSERT INTO CUSTOMER VALUES('182','Billy'   ,'Rufton',    '21 Simple Cir',     'Garland',  'WY','82435','billyruff@example.com',   43.13 ,750.00   ,'10');              
INSERT INTO CUSTOMER VALUES('227','Sandra'  ,'Pincher',   '53 Verde Ln',       'Powell',   'WY','82440','spinch2@example.com',     156.38,500.00   ,'15');              
INSERT INTO CUSTOMER VALUES('294','Samantha','Smith',     '14 Rock Ln',        'Ralston',  'WY','82440','ssmith5@example.com',     58.60 ,500.00   ,'10');              
INSERT INTO CUSTOMER VALUES('314','Tom'     ,'Rascal',    '1 Rascal Farm Rd',  'Cody',     'WY','82414','trascal3@example.com',    17.25 ,250.00   ,'15');              
INSERT INTO CUSTOMER VALUES('375','Melanie' ,'Jackson',   '42 Blackwater Way', 'Elk Butte','WY','82433','mjackson5@example.com',   252.25,250.00   ,'05');              
INSERT INTO CUSTOMER VALUES('435','James'   ,'Gonzalez',  '16 Rockway Rd',     'Wapiti',   'WY','82450','jgonzo@example.com',      230.40,1000.00  ,'15');              
INSERT INTO CUSTOMER VALUES('492','Elmer'   ,'Jackson',   '22 Jackson Farm Rd','Garland',  'WY','82435','ejackson4@example.com',   45.20 ,500.00   ,'10');              
INSERT INTO CUSTOMER VALUES('543','Angie'   ,'Hendricks', '27 Locklear Ln',    'Powell',   'WY','82440','ahendricks7@example.com', 315.00,750.00   ,'05');              
INSERT INTO CUSTOMER VALUES('616','Sally'   ,'Cruz',      '199 18th Ave',      'Ralston',  'WY','82440','scruz5@example.com',      8.33  ,500.00   ,'15');              
INSERT INTO CUSTOMER VALUES('721','Leslie'  ,'Smith',     '123 Sheepland Rd',  'Elk Butte','WY','82433','lsmith12@example.com',    166.65,1000.00  ,'10');              
INSERT INTO CUSTOMER VALUES('795','Randy'   ,'Blacksmith','75 Stream Rd',      'Cody',     'WY','82414','rblacksmith6@example.com',61.50 ,500.00   ,'05');              

DROP TABLE IF EXISTS ITEM;
CREATE TABLE ITEM
(
   ITEM_ID  CHAR(4) PRIMARY KEY,
   DESCRIPTION VARCHAR(30),
   ON_HAND NUMERIC,
   CATEGORY CHAR(3),
   LOCATION CHAR(1),
   PRICE DECIMAL(7,2)
);
                                                     
INSERT INTO ITEM VALUES('AD72','Dog Feeding Station'           ,'12','DOG','B',79.99 );
INSERT INTO ITEM VALUES('BC33','Feathers Bird Cage (12x24x18)' ,'10','BRD','B',79.99 );
INSERT INTO ITEM VALUES('CA75','Enclosed Cat Litter Station'   ,'15','CAT','C',39.99 );
INSERT INTO ITEM VALUES('DT12','Dog Toy Gift Set'              ,'27','DOG','B',39.99 );
INSERT INTO ITEM VALUES('FM23','Fly Mask with Ears'            ,'41','HOR','C',24.95 );
INSERT INTO ITEM VALUES('FS39','Folding Saddle Stand'          ,'12','HOR','C',39.99 );
INSERT INTO ITEM VALUES('FS42','Aquarium (55 Gallon)'          ,'5','FSH','A',124.99);
INSERT INTO ITEM VALUES('KH81','Wild Bird Food (25 lb)'        ,'24','BRD','C',19.99 );
INSERT INTO ITEM VALUES('LD14','Locking Small Dog Door'        ,'14','DOG','A',49.99 );
INSERT INTO ITEM VALUES('LP73','Large Pet Carrier'             ,'23','DOG','B',59.99 );
INSERT INTO ITEM VALUES('PF19','Pump & Filter Kit'             ,'5','FSH','A',74.99 );
INSERT INTO ITEM VALUES('QB92','Quilted Stable Blanket'        ,'32','HOR','C',119.99);
INSERT INTO ITEM VALUES('SP91','Small Pet Carrier'             ,'18','CAT','B',39.99 );
INSERT INTO ITEM VALUES('UF39','Underground Fence System'      ,'7','DOG','A',199.99);
INSERT INTO ITEM VALUES('WB49','Insulated Water Bucket'        ,'34','HOR','C',79.99 );
                               
DROP TABLE IF EXISTS INVOICES;
CREATE TABLE INVOICES
(
    INVOICE_NUM CHAR(5) PRIMARY KEY,
    INVOICE_DATE DATE,
    CUST_ID VARCHAR(3)
);


INSERT INTO INVOICES VALUES('14216','2021-11-15','125');      
INSERT INTO INVOICES VALUES('14219','2021-11-15','227');      
INSERT INTO INVOICES VALUES('14222','2021-11-16','294');      
INSERT INTO INVOICES VALUES('14224','2021-11-16','182');      
INSERT INTO INVOICES VALUES('14228','2021-11-18','435');      
INSERT INTO INVOICES VALUES('14231','2021-11-18','125');      
INSERT INTO INVOICES VALUES('14233','2021-11-18','435');      
INSERT INTO INVOICES VALUES('14237','2021-11-19','616');      


DROP TABLE IF EXISTS INVOICE_LINE;
CREATE TABLE INVOICE_LINE
(
   INVOICE_NUM CHAR(5),
   ITEM_ID CHAR(4),
   QUANTITY NUMERIC,
   QUOTED_PRICE DECIMAL(7,2),
   PRIMARY KEY (INVOICE_NUM, ITEM_ID)
);

INSERT INTO INVOICE_LINE VALUES('14216','CA75',3,37.99 );               
INSERT INTO INVOICE_LINE VALUES('14219','AD72',2,79.99 );               
INSERT INTO INVOICE_LINE VALUES('14219','DT12',4,39.99 );               
INSERT INTO INVOICE_LINE VALUES('14222','LD14',1,47.99 );               
INSERT INTO INVOICE_LINE VALUES('14224','KH81',4,18.99 );               
INSERT INTO INVOICE_LINE VALUES('14228','FS42',1,124.99);               
INSERT INTO INVOICE_LINE VALUES('14228','PF19',1,74.99 );               
INSERT INTO INVOICE_LINE VALUES('14231','UF39',2,189.99);               
INSERT INTO INVOICE_LINE VALUES('14233','KH81',1,19.99 );               
INSERT INTO INVOICE_LINE VALUES('14233','QB92',4,109.95);               
INSERT INTO INVOICE_LINE VALUES('14233','WB49',4,74.95 );               
INSERT INTO INVOICE_LINE VALUES('14237','LP73',3,54.95 );

 * sqlite:///KIMTAY.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Simple Queries Examples

### Visualizing a single table

In SQL, the command we use to see the contents of a table is the [**`SELECT`**](https://www.w3schools.com/sql/sql_select.asp) command. In Excel you simply open the spreadsheet and the data appears immediately before your eyes. With SQL, it is a bit different. You have to "call" or "query" the data with `SELECT`. The syntax is as follows:

~~~sql
SELECT column_name(s) FROM table_name
~~~

For instance, if we wanted to retrieve the `FIRST_NAME` and the `LAST_NAME`columnS from the `CUSTOMER` table, this would be the code:

In [7]:
%%sql

SELECT FIRST_NAME, LAST_NAME FROM CUSTOMER;

 * sqlite:///KIMTAY.db
Done.

[('Joey', 'Smith'),
 ('Billy', 'Rufton'),
 ('Sandra', 'Pincher'),
 ('Samantha', 'Smith'),
 ('Tom', 'Rascal'),
 ('Melanie', 'Jackson'),
 ('James', 'Gonzalez'),
 ('Elmer', 'Jackson'),
 ('Angie', 'Hendricks'),
 ('Sally', 'Cruz'),
 ('Leslie', 'Smith'),
 ('Randy', 'Blacksmith')]

If you want to apply filters to your table, you have to use the [**`WHERE`**](https://www.w3schools.com/sql/sql_where.asp) keyword. This keyword establishes the conditions that you want to filter by. For instance, if you want to see only the customers that were served by the sales rep with ID 15. 

~~~sql
WHERE REP_ID = '15'
~~~

In context:

In [8]:
%%sql

SELECT FIRST_NAME, LAST_NAME FROM CUSTOMER WHERE REP_ID = '15';

 * sqlite:///KIMTAY.db
Done.

[('Sandra', 'Pincher'),
 ('Tom', 'Rascal'),
 ('James', 'Gonzalez'),
 ('Sally', 'Cruz')]

### Comparison operators 

( =, >, <, >=, <=, <>)

Examples:

**Example (1)**

Retrive the last name of the customer with the ID 125

In [9]:
%%sql
SELECT LAST_NAME 
FROM CUSTOMER 
WHERE CUST_ID = '125';

 * sqlite:///KIMTAY.db
Done.

[('Smith',)]

**Example (2)**

Retrive a table of customers who have a balance that is greater than their credit limit

In [10]:
%%sql
SELECT FIRST_NAME, LAST_NAME, BALANCE, CREDIT_LIMIT
FROM CUSTOMER
WHERE BALANCE > CREDIT_LIMIT;

 * sqlite:///KIMTAY.db
Done.

[('Melanie', 'Jackson', 252.25, 250)]

### Compound conditions 

(and, or, not)

*And*: all simple conditions must be **TRUE**

*Or*: one simple condition must be **TRUE**

*Not*: reverses the **truth** of the original condition

**Example (3)**

Return a list of descriptions of items that are located in location B and have a quantity on hand greater than 15

In [11]:
%%sql
SELECT DESCRIPTION 
FROM ITEM 
WHERE LOCATION = 'B' AND ON_HAND> 15;

 * sqlite:///KIMTAY.db
Done.

[('Dog Toy Gift Set',), ('Large Pet Carrier',), ('Small Pet Carrier',)]

**Example (4)**

Return a list of descriptions of items that are located in location B or have a quantity on hand greater than 15

In [12]:
%%sql
SELECT DESCRIPTION
FROM ITEM
WHERE (LOCATION = 'B') OR (ON_HAND >15);

 * sqlite:///KIMTAY.db
Done.

[('Dog Feeding Station',),
 ('Feathers Bird Cage (12x24x18)',),
 ('Dog Toy Gift Set',),
 ('Fly Mask with Ears',),
 ('Wild Bird Food (25 lb)',),
 ('Large Pet Carrier',),
 ('Quilted Stable Blanket',),
 ('Small Pet Carrier',),
 ('Insulated Water Bucket',)]

**Example (5)**

Return a list of descriptions of items that are not located in location B

In [13]:
%%sql
SELECT DESCRIPTION
FROM ITEM
WHERE NOT LOCATION = 'B';

 * sqlite:///KIMTAY.db
Done.

[('Enclosed Cat Litter Station',),
 ('Fly Mask with Ears',),
 ('Folding Saddle Stand',),
 ('Aquarium (55 Gallon)',),
 ('Wild Bird Food (25 lb)',),
 ('Locking Small Dog Door',),
 ('Pump & Filter Kit',),
 ('Quilted Stable Blanket',),
 ('Underground Fence System',),
 ('Insulated Water Bucket',)]

### Derived Attributes

Using arithmetic operators (+, -, *, /)

**[AS]** clause (assign a name to a computed column)

**Example (6)**

Return a table of customers with their ID, first name, last name, and available credit

In [14]:
%%sql
SELECT CUST_ID, FIRST_NAME, LAST_NAME, CREDIT_LIMIT - BALANCE AS AVAILABLE_CREDIT
FROM CUSTOMER;

 * sqlite:///KIMTAY.db
Done.

[('125', 'Joey', 'Smith', 419.32),
 ('182', 'Billy', 'Rufton', 706.87),
 ('227', 'Sandra', 'Pincher', 343.62),
 ('294', 'Samantha', 'Smith', 441.4),
 ('314', 'Tom', 'Rascal', 232.75),
 ('375', 'Melanie', 'Jackson', -2.25),
 ('435', 'James', 'Gonzalez', 769.6),
 ('492', 'Elmer', 'Jackson', 454.8),
 ('543', 'Angie', 'Hendricks', 435),
 ('616', 'Sally', 'Cruz', 491.67),
 ('721', 'Leslie', 'Smith', 833.35),
 ('795', 'Randy', 'Blacksmith', 438.5)]

### Sorting

**Example (7)**

Return able of customers with their ID, first name, last name, and balance, ordered by balance from lowest to highest

In [15]:
%%sql
SELECT CUST_ID, FIRST_NAME, LAST_NAME, BALANCE
FROM CUSTOMER
ORDER BY BALANCE;

 * sqlite:///KIMTAY.db
Done.

[('616', 'Sally', 'Cruz', 8.33),
 ('314', 'Tom', 'Rascal', 17.25),
 ('182', 'Billy', 'Rufton', 43.13),
 ('492', 'Elmer', 'Jackson', 45.2),
 ('294', 'Samantha', 'Smith', 58.6),
 ('795', 'Randy', 'Blacksmith', 61.5),
 ('125', 'Joey', 'Smith', 80.68),
 ('227', 'Sandra', 'Pincher', 156.38),
 ('721', 'Leslie', 'Smith', 166.65),
 ('435', 'James', 'Gonzalez', 230.4),
 ('375', 'Melanie', 'Jackson', 252.25),
 ('543', 'Angie', 'Hendricks', 315)]

**Additional sorting options**

Sorting data on two columns: major and minor sort keys

For descending order sort use DESC

**Example (8)**

Return a table of customers with their ID, first name, last name, and credit limit, ordered by credit limit from highest to lowest, and then by last name

In [17]:
%%sql
SELECT CUST_ID, FIRST_NAME, LAST_NAME, CREDIT_LIMIT
FROM CUSTOMER
ORDER BY CREDIT_LIMIT DESC, LAST_NAME;

 * sqlite:///KIMTAY.db
Done.

[('435', 'James', 'Gonzalez', 1000),
 ('721', 'Leslie', 'Smith', 1000),
 ('543', 'Angie', 'Hendricks', 750),
 ('182', 'Billy', 'Rufton', 750),
 ('795', 'Randy', 'Blacksmith', 500),
 ('616', 'Sally', 'Cruz', 500),
 ('492', 'Elmer', 'Jackson', 500),
 ('227', 'Sandra', 'Pincher', 500),
 ('125', 'Joey', 'Smith', 500),
 ('294', 'Samantha', 'Smith', 500),
 ('375', 'Melanie', 'Jackson', 250),
 ('314', 'Tom', 'Rascal', 250)]

### Agregation Functions

The following are the most commonly used SQL aggregation functions:

1. **`AVG()`** – calculates the average of a set of values
2. **`COUNT()`** – counts rows in a specified table or view
3. **`MIN()`** – gets the minimum value in a set of values
4. **`MAX()`** – gets the maximum value in a set of values
5. **`SUM()`** – calculates the sum of values

**Example (9)**

Return a table with three columns, where:

1. TOTAL_BALANCE is the total balance of all customers.
2. MAX_BALANCE is the maximum balance of any customer.
3. MIN_BALANCE is the minimum balance of any customer.

In [18]:
%%sql
SELECT SUM(BALANCE) AS TOTAL_BALANCE, MAX(BALANCE) AS MAX_BALANCE, MIN(BALANCE) AS MIN_BALANCE
FROM CUSTOMER;

 * sqlite:///KIMTAY.db
Done.

[(1435.37, 315, 8.33)]

### Group by and Having
**Grouping:**
    
Creates groups of rows that share common characteristics. When grouping rows, any calculations indicated in the [**`SELECT`**] command are performed for the entire group. This is done with the [**`GROUP BY`**](https://www.w3schools.com/sql/sql_groupby.asp) keyword, followed by a column to group by.

**Having clause:**

Used to restrict groups that will be included in query results.

*Having VS Where:**
1. Where: Limits rows
2. Having: Limits groups
3. Can be used together if condition involves both rows and groups

**Example (10)**

Return a table with two columns, where MEAN_BALANCE is the average balance of customers assigned to each representative id.

In [19]:
%%sql
SELECT REP_ID, AVG(BALANCE) AS MEAN_BALANCE
FROM CUSTOMER
GROUP BY REP_ID
ORDER BY REP_ID;

 * sqlite:///KIMTAY.db
Done.

[('05', 177.35750000000002),
 ('10', 78.39500000000001),
 ('15', 103.08999999999999)]

In [20]:
%%sql
SELECT REP_ID, AVG(BALANCE)
FROM CUSTOMER
GROUP BY REP_ID
HAVING AVG (BALANCE) > 100
ORDER BY REP_ID;

 * sqlite:///KIMTAY.db
Done.

[('05', 177.35750000000002), ('15', 103.08999999999999)]